ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПриемВСпортивноеУчреждение</name>
  <registerRecords>InformationRegister.ПредоставленныеДокументыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРазвитияИЗдоровьяСпортсмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаОбработкуПерсональныхДанныхПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСогласиеНаОбработкуПерсональныхДанных</name>
    <type>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерновикЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоИзВнешнегоИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоставленаКопия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлДокумента</name>
      <type>
        <types>CatalogRef.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ПрисвоениеРазряда/ПрисвоениеРазряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоениеРазряда</name>
  <registerRecords>InformationRegister.ПодтвержденныеРазрядыСпортсменов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПрисвоившаяРазряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>CatalogRef.СпортивнаяКлассификация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисвоения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтверждения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ПодтверждениеРазрядаСпортсмена/ПодтверждениеРазрядаСпортсмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодтверждениеРазрядаСпортсмена</name>
  <basedOn>Document.ПрисвоениеРазряда</basedOn>
  <registerRecords>InformationRegister.ПодтвержденныеРазрядыСпортсменов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПрисвоениеРазряда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>CatalogRef.СпортивнаяКлассификация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтверждения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоПодтверждения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/CommonForms/СписокФайловСпортсмена/Module.bsl
#Область ОбработчикиСобытийФормы

// {Рарус adilas #18956 -В представлении спортсмена кнопка Список документов 2021.08.31
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		
		СформироватьТаблицуФайлов(Параметры.Спортсмен);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьТаблицуФайлов(Спортсмен)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.Ссылка КАК Ссылка,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.ВидДокумента КАК ВидДокумента,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.ФайлДокумента КАК ФайлДокумента
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	Документ.ЗаявленияНаПриемВСпортивноеУчреждение.ПредоставленныеДокументы КАК ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы
		|ГДЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.Ссылка.Спортсмен = &Спортсмен
		|	И ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.ВидДокумента,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.Ссылка,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПредоставленныеДокументы.ФайлДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрисвоениеРазрядаСпортсмены.Разряд КАК Разряд,
		|	ПрисвоениеРазрядаСпортсмены.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Присвоение
		|ИЗ
		|	Документ.ПрисвоениеРазряда.Спортсмены КАК ПрисвоениеРазрядаСпортсмены
		|ГДЕ
		|	ПрисвоениеРазрядаСпортсмены.Спортсмен = &Спортсмен
		|	И ПрисвоениеРазрядаСпортсмены.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтверждениеРазрядаСпортсменаСпортсмены.Разряд КАК Разряд,
		|	ПодтверждениеРазрядаСпортсменаСпортсмены.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Подтверждение
		|ИЗ
		|	Документ.ПодтверждениеРазрядаСпортсмена.Спортсмены КАК ПодтверждениеРазрядаСпортсменаСпортсмены
		|ГДЕ
		|	ПодтверждениеРазрядаСпортсменаСпортсмены.Спортсмен = &Спортсмен
		|	И ПодтверждениеРазрядаСпортсменаСпортсмены.Ссылка = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Включение спортсменов в группу"" КАК ИмяОбъекта,
		|	ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла.Группа.Представление КАК Группа,
		|	ВключениеСпортсменовВГруппуПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ВключениеСпортсменовВГруппуПрисоединенныеФайлы КАК ВключениеСпортсменовВГруппуПрисоединенныеФайлы
		|ГДЕ
		|	ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ВключениеСпортсменовВГруппуПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Допуск к соревнованиям"" КАК ИмяОбъекта,
		|	ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы КАК ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы
		|ГДЕ
		|	ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ДопускиУчастниковКСпортивнымСоревнованиямПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Зачисление на этап"" КАК ИмяОбъекта,
		|	ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Этап.Представление КАК Этап,
		|	ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы КАК ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы
		|ГДЕ
		|	ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ЗачислениеСпортсменовНаЭтапПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Заявка на соревнование"" КАК ИмяОбъекта,
		|	ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла.Соревнование.Представление КАК Соревнование,
		|	ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы КАК ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы
		|ГДЕ
		|	ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И ЗаявкаНаПроведениеСоревнованияПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Заявка на соревнование ОФП"" КАК ИмяОбъекта,
		|	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.Ссылка КАК Файл,
		|	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы КАК ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы
		|ГДЕ
		|	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФППрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Заявление на прием"" КАК ИмяОбъекта,
		|	ВТ_Документы.ВидДокумента.Представление КАК ВидДокумента,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.Представление КАК Представление,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы КАК ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы
		|		ПО (ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.ВладелецФайла.Ссылка = ВТ_Документы.Ссылка)
		|			И (ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.Ссылка = ВТ_Документы.ФайлДокумента)
		|ГДЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.ВладелецФайла.Спортсмен = &Спортсмен
		|	И ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Документы.ВидДокумента.Представление,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.Представление,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.Ссылка,
		|	ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы.ВладелецФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Исключение из учреждения"" КАК ИмяОбъекта,
		|	ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы КАК ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы
		|ГДЕ
		|	ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы.ВладелецФайла.Спортсмен = &Спортсмен
		|	И ИсключениеИзСпортивногоУчрежденияПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Исключение из группы"" КАК ИмяОбъекта,
		|	ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла.Группа.Представление КАК Группа,
		|	ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы КАК ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы
		|ГДЕ
		|	ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ИсключениеСпортсменовИзГруппыПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Отзыв согласия ПДн"" КАК ИмяОбъекта,
		|	ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы КАК ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы
		|ГДЕ
		|	ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ВладелецФайла.Субъект = &Спортсмен
		|	И ОтзывСогласияНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Перевод между группами"" КАК ИмяОбъекта,
		|	ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла.Группа.Представление КАК Группа,
		|	ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы КАК ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы
		|ГДЕ
		|	ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ПереводСпортсменовМеждуГруппамиПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Перевод на этап"" КАК ИмяОбъекта,
		|	ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Тренер.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Этап.Представление КАК Этап,
		|	ПереводСпортсменовНаЭтапПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПереводСпортсменовНаЭтапПрисоединенныеФайлы КАК ПереводСпортсменовНаЭтапПрисоединенныеФайлы
		|ГДЕ
		|	ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ПереводСпортсменовНаЭтапПрисоединенныеФайлы.ВладелецФайла = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Подтверждение разряда"" КАК ИмяОбъекта,
		|	ВТ_Подтверждение.Разряд КАК Разряд,
		|	ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы КАК ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подтверждение КАК ВТ_Подтверждение
		|		ПО ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы.ВладелецФайла.Ссылка = ВТ_Подтверждение.Ссылка
		|ГДЕ
		|	ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ПодтверждениеРазрядаСпортсменаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Присвоение разряда"" КАК ИмяОбъекта,
		|	ВТ_Присвоение.Разряд КАК Разряд,
		|	ПрисвоениеРазрядаПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПрисвоениеРазрядаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПрисвоениеРазрядаПрисоединенныеФайлы КАК ПрисвоениеРазрядаПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Присвоение КАК ВТ_Присвоение
		|		ПО ПрисвоениеРазрядаПрисоединенныеФайлы.ВладелецФайла.Ссылка = ВТ_Присвоение.Ссылка
		|ГДЕ
		|	ПрисвоениеРазрядаПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ПрисвоениеРазрядаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Протокол ОФП"" КАК ИмяОбъекта,
		|	ПротоколОФПСдачаНормативовПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПротоколОФПСдачаНормативовПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПротоколОФПСдачаНормативовПрисоединенныеФайлы КАК ПротоколОФПСдачаНормативовПрисоединенныеФайлы
		|ГДЕ
		|	ПротоколОФПСдачаНормативовПрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И ПротоколОФПСдачаНормативовПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Протокол соревнования"" КАК ИмяОбъекта,
		|	ПротоколСоревнованияПрисоединенныеФайлы.ВладелецФайла.Соревнование.Представление КАК Соревнование,
		|	ПротоколСоревнованияПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПротоколСоревнованияПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ПротоколСоревнованияПрисоединенныеФайлы КАК ПротоколСоревнованияПрисоединенныеФайлы
		|ГДЕ
		|	ПротоколСоревнованияПрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И ПротоколСоревнованияПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Регистрация достижений"" КАК ИмяОбъекта,
		|	РегистрацияДостиженийСпортсменовПрисоединенныеФайлы.Ссылка КАК Файл,
		|	РегистрацияДостиженийСпортсменовПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.РегистрацияДостиженийСпортсменовПрисоединенныеФайлы КАК РегистрацияДостиженийСпортсменовПрисоединенныеФайлы
		|ГДЕ
		|	РегистрацияДостиженийСпортсменовПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И РегистрацияДостиженийСпортсменовПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Согласие на обработку ПДн"" КАК ИмяОбъекта,
		|	СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы КАК СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы
		|ГДЕ
		|	СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ВладелецФайла.Субъект = &Спортсмен
		|	И СогласиеНаОбработкуПерсональныхДанныхПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Соревнование ОФП"" КАК ИмяОбъекта,
		|	СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы КАК СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы
		|ГДЕ
		|	СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И СоревнованиеОФПСдачаНормативовПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Соревнование"" КАК ИмяОбъекта,
		|	СоревнованиеПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СоревнованиеПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.СоревнованиеПрисоединенныеФайлы КАК СоревнованиеПрисоединенныеФайлы
		|ГДЕ
		|	СоревнованиеПрисоединенныеФайлы.ВладелецФайла.СоставУчастников.Спортсмен = &Спортсмен
		|	И СоревнованиеПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Карточка спортсмена"" КАК ИмяОбъекта,
		|	СпортсменыПрисоединенныеФайлы.ВладелецФайла.Представление КАК Спортсмен,
		|	СпортсменыПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СпортсменыПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.СпортсменыПрисоединенныеФайлы КАК СпортсменыПрисоединенныеФайлы
		|ГДЕ
		|	СпортсменыПрисоединенныеФайлы.ВладелецФайла.Ссылка = &Спортсмен
		|	И СпортсменыПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Страховой полис"" КАК ИмяОбъекта,
		|	СтраховойПолисСпортсменаПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СтраховойПолисСпортсменаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.СтраховойПолисСпортсменаПрисоединенныеФайлы КАК СтраховойПолисСпортсменаПрисоединенныеФайлы
		|ГДЕ
		|	СтраховойПолисСпортсменаПрисоединенныеФайлы.ВладелецФайла.Спортсмен = &Спортсмен
		|	И СтраховойПолисСпортсменаПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Закрепление в группу"" КАК ИмяОбъекта,
		|	ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла.Группа.Представление КАК Группа,
		|	ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Фамилия + "" "" + ПОДСТРОКА(ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла.ТренерСборной.ФизическоеЛицо.Отчество, 1, 1) + ""."" КАК Тренер,
		|	ФормированиеГруппыПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ФормированиеГруппыПрисоединенныеФайлы КАК ФормированиеГруппыПрисоединенныеФайлы
		|ГДЕ
		|	ФормированиеГруппыПрисоединенныеФайлы.ВладелецФайла.Спортсмены.Спортсмен = &Спортсмен
		|	И ФормированиеГруппыПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Карточка законного представителя "" КАК ИмяОбъекта,
		|	РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы.ВладелецФайла.Представление КАК Родитель,
		|	РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы.Ссылка КАК Файл,
		|	РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы КАК РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы
		|ГДЕ
		|	РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы.ВладелецФайла.Владелец.Ссылка = &Спортсмен
		|	И РодителиЗаконныеПредставителиСпортсменовПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Спортсмен", Спортсмен);
	
	СписокФайлов.Очистить();
	
	Пакет = Запрос.ВыполнитьПакет();
	тзВключениеВГруппу = Пакет[3].Выгрузить();

	Если Не тзВключениеВГруппу.Количество() = 0 Тогда
		Для Каждого СтрокаВключение Из тзВключениеВГруппу Цикл   
			НоваяСтрока = СписокФайлов.Добавить(); 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2, гр.%3)", СтрокаВключение.ИмяОбъекта, СтрокаВключение.Тренер, СтрокаВключение.Группа); 		
			НоваяСтрока.Файл 			= СтрокаВключение.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаВключение.ВладелецФайла;
		КонецЦикла;	
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзДопуски = Пакет[4].Выгрузить();

	Если Не тзДопуски.Количество() = 0 Тогда
		Для Каждого СтрокаДопуски Из тзДопуски Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаДопуски.ИмяОбъекта; 		
			НоваяСтрока.Файл		 	= СтрокаДопуски.Представление;
			НоваяСтрока.ВладелецФайла 	= СтрокаДопуски.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзЗачислениеНаЭтап = Пакет[5].Выгрузить();
	
	Если Не тзЗачислениеНаЭтап.Количество() = 0 Тогда
		Для Каждого СтрокаЗачисление Из тзЗачислениеНаЭтап Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2, этап:%3)", СтрокаЗачисление.ИмяОбъекта, СтрокаЗачисление.Тренер, СтрокаЗачисление.Этап); 		
			НоваяСтрока.Файл 			= СтрокаЗачисление.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаЗачисление.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзЗаявкаНаСоревнование = Пакет[6].Выгрузить();
	
	Если Не тзЗаявкаНаСоревнование.Количество() = 0 Тогда
		Для Каждого СтрокаЗаявка Из тзЗаявкаНаСоревнование Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2, соревнование:%3)", СтрокаЗаявка.ИмяОбъекта, СтрокаЗаявка.Тренер, СтрокаЗаявка.Соревнование);							
			НоваяСтрока.Файл 			= СтрокаЗаявка.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаЗаявка.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзЗаявкаНаСоревнованиеОФП = Пакет[7].Выгрузить();
	
	Если Не тзЗаявкаНаСоревнованиеОФП.Количество() = 0 Тогда
		Для Каждого СтрокаЗаявка Из тзЗаявкаНаСоревнованиеОФП Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2)", СтрокаЗаявка.ИмяОбъекта, СтрокаЗаявка.Тренер);  		
			НоваяСтрока.Файл 			= СтрокаЗаявка.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаЗаявка.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзЗаявление = Пакет[8].Выгрузить();
	
	Если Не тзЗаявление.Количество() = 0 Тогда
		Для Каждого СтрокаЗаявление Из тзЗаявление Цикл   											
			НоваяСтрока = СписокФайлов.Добавить();							 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаЗаявление.ИмяОбъекта, СтрокаЗаявление.ВидДокумента);		
			НоваяСтрока.Файл 			= СтрокаЗаявление.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаЗаявление.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзИсключение = Пакет[9].Выгрузить();
	
	Если Не тзИсключение.Количество() = 0 Тогда
		Для Каждого СтрокаИсключение Из тзИсключение Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаИсключение.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаИсключение.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаИсключение.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзИсключениеИзГруппы = Пакет[10].Выгрузить();

	Если Не тзИсключениеИзГруппы.Количество() = 0 Тогда
		Для Каждого СтрокаИсключение Из тзИсключениеИзГруппы Цикл   
			НоваяСтрока = СписокФайлов.Добавить(); 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2 гр.%3)", СтрокаИсключение.ИмяОбъекта, СтрокаИсключение.Тренер, СтрокаИсключение.Группа); 		
			НоваяСтрока.Файл 			= СтрокаИсключение.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаИсключение.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзОтзыв = Пакет[11].Выгрузить();
	
	Если Не тзОтзыв.Количество() = 0 Тогда
		Для Каждого СтрокаОтзыв Из тзОтзыв Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаОтзыв.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаОтзыв.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаОтзыв.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзПереводМеждуГруппами = Пакет[12].Выгрузить();

	Если Не тзПереводМеждуГруппами.Количество() = 0 Тогда
		Для Каждого СтрокаПеревод Из тзПереводМеждуГруппами Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2 гр.%3)", СтрокаПеревод.ИмяОбъекта, СтрокаПеревод.Тренер, СтрокаПеревод.Группа); 		
			НоваяСтрока.Файл 			= СтрокаПеревод.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПеревод.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзПереводНаЭтап = Пакет[13].Выгрузить();

	Если Не тзПереводНаЭтап.Количество() = 0 Тогда
		Для Каждого СтрокаПеревод Из тзПереводНаЭтап Цикл   
			НоваяСтрока = СписокФайлов.Добавить();     
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2 этап:%3)", СтрокаПеревод.ИмяОбъекта, СтрокаПеревод.Тренер, СтрокаПеревод.Этап); 		
			НоваяСтрока.Файл 			= СтрокаПеревод.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПеревод.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
			
	Пакет = Запрос.ВыполнитьПакет();
	тзПодтверждение = Пакет[14].Выгрузить();

	Если Не тзПодтверждение.Количество() = 0 Тогда
		Для Каждого СтрокаПодтверждение Из тзПодтверждение Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаПодтверждение.ИмяОбъекта, СтрокаПодтверждение.Разряд); 		
			НоваяСтрока.Файл 			= СтрокаПодтверждение.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПодтверждение.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзПрисвоение = Пакет[15].Выгрузить();

	Если Не тзПрисвоение.Количество() = 0 Тогда
		Для Каждого СтрокаПрисвоение Из тзПрисвоение Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаПрисвоение.ИмяОбъекта, СтрокаПрисвоение.Разряд); 		
			НоваяСтрока.Файл 			= СтрокаПрисвоение.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПрисвоение.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзПротоколОФП = Пакет[16].Выгрузить();

	Если Не тзПротоколОФП.Количество() = 0 Тогда
		Для Каждого СтрокаПротокол Из тзПротоколОФП Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаПротокол.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаПротокол.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПротокол.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзПротоколСоревнование = Пакет[17].Выгрузить();

	Если Не тзПротоколСоревнование.Количество() = 0 Тогда
		Для Каждого СтрокаПротокол Из тзПротоколСоревнование Цикл   
			НоваяСтрока = СписокФайлов.Добавить(); 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаПрисвоение.ИмяОбъекта, СтрокаПротокол.Соревнование); 		
			НоваяСтрока.Файл 			= СтрокаПротокол.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаПротокол.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзДостижения = Пакет[18].Выгрузить();

	Если Не тзДостижения.Количество() = 0 Тогда
		Для Каждого СтрокаДостижения Из тзДостижения Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаДостижения.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаДостижения.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаДостижения.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзСогласие = Пакет[19].Выгрузить();

	Если Не тзСогласие.Количество() = 0 Тогда
		Для Каждого СтрокаСогласие Из тзСогласие Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаСогласие.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаСогласие.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаСогласие.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзСоревнованиеОФП = Пакет[20].Выгрузить();

	Если Не тзСоревнованиеОФП.Количество() = 0 Тогда
		Для Каждого СтрокаСоревнование Из тзСоревнованиеОФП Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаСоревнование.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаСоревнование.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаСоревнование.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзСоревнование = Пакет[21].Выгрузить();

	Если Не тзСоревнование.Количество() = 0 Тогда
		Для Каждого СтрокаСоревнование Из тзСоревнование Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаСоревнование.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаСоревнование.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаСоревнование.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзКарточка = Пакет[22].Выгрузить();

	Если Не тзКарточка.Количество() = 0 Тогда
		Для Каждого СтрокаКарточка Из тзКарточка Цикл   
			НоваяСтрока = СписокФайлов.Добавить();  
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаКарточка.ИмяОбъекта, СтрокаКарточка.Спортсмен); 		
			НоваяСтрока.Файл 			= СтрокаКарточка.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаКарточка.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзСтраховой = Пакет[23].Выгрузить();

	Если Не тзСтраховой.Количество() = 0 Тогда
		Для Каждого СтрокаСтраховой Из тзСтраховой Цикл   
			НоваяСтрока = СписокФайлов.Добавить();
			НоваяСтрока.ВидОбъекта 		= СтрокаСтраховой.ИмяОбъекта; 		
			НоваяСтрока.Файл 			= СтрокаСтраховой.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаСтраховой.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзФормирование = Пакет[24].Выгрузить();

	Если Не тзФормирование.Количество() = 0 Тогда
		Для Каждого СтрокаФормирование Из тзФормирование Цикл   
			НоваяСтрока = СписокФайлов.Добавить(); 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (тренер:%2 гр.%3)", СтрокаФормирование.ИмяОбъекта, СтрокаФормирование.Тренер, СтрокаФормирование.Группа); 		
			НоваяСтрока.Файл 			= СтрокаФормирование.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаФормирование.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	тзРодители = Пакет[25].Выгрузить();

	Если Не тзРодители.Количество() = 0 Тогда
		Для Каждого СтрокаРодители Из тзРодители Цикл   
			НоваяСтрока = СписокФайлов.Добавить(); 
			НоваяСтрока.ВидОбъекта 		= СтрШаблон("%1: (%2)", СтрокаРодители.ИмяОбъекта, СтрокаРодители.Родитель); 		
			НоваяСтрока.Файл 			= СтрокаРодители.Файл;
			НоваяСтрока.ВладелецФайла 	= СтрокаРодители.ВладелецФайла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловОписаниеФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;                
	ПараметрыФормы.Вставить("ВладелецФайла",  		ТекущиеДанные.ВладелецФайла);
	ПараметрыФормы.Вставить("ПрисоединенныйФайл",  	ТекущиеДанные.Файл);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныйФайл",
		ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВидОбъектаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	ПоказатьЗначение(, ТекущиеДанные.ВладелецФайла);
	
КонецПроцедуры
// }Рарус adilas #18956 -В представлении спортсмена кнопка Список документов 2021.08.31

#КонецОбласти
